
**Prueba Técnica**

In [ ]:
#Importaciones

import pandas as pd

In [5]:
#Carga de datos

df = pd.read_excel("datos_ventas.xlsx")
df.head()

,ID_Venta,Fecha,Producto,Cantidad,Precio_Unitario,Total_Venta,Vendedor,ID_Cruce
0,1,2023-06-02,Monitor,3,669,2007.0,Elena,101
1,2,2023-12-16,Celular,3,172,516.0,Ana,102
2,3,2023-03-02,Monitor,5,765,3825.0,Elena,103
3,4,2023-03-19,Laptop,4,303,1212.0,Carlos,104
4,5,2023-01-24,Impresora,8,644,NaN,David,105

In [9]:
#Verificar valores faltantes (NaN).
df.isnull().sum()

ID_Venta           0
Fecha              0
Producto           0
Cantidad           0
Precio_Unitario    0
Total_Venta        0
Vendedor           0
ID_Cruce           0
dtype: int64

In [10]:
#Encontramos que hay 25 valores faltantes en la columna Total_Venta. Para completarlos, usamos la fórmula: Total_Venta = Cantidad * Precio_Unitario.

df["Total_Venta"] = df["Total_Venta"].fillna(df["Cantidad"] * df["Precio_Unitario"])
df.isnull().sum()

ID_Venta           0
Fecha              0
Producto           0
Cantidad           0
Precio_Unitario    0
Total_Venta        0
Vendedor           0
ID_Cruce           0
dtype: int64

In [11]:
#Revisar tipos de datos
df.dtypes

ID_Venta             int64
Fecha               object
Producto            object
Cantidad             int64
Precio_Unitario      int64
Total_Venta        float64
Vendedor            object
ID_Cruce             int64
dtype: object

In [12]:
#Convertir la columna Fecha a formato datetime.
df["Fecha"] = pd.to_datetime(df["Fecha"])
df[["ID_Venta", "Fecha"]].head()

   ID_Venta      Fecha
0         1 2023-06-02
1         2 2023-12-16
2         3 2023-03-02
3         4 2023-03-19
4         5 2023-01-24

In [13]:
#Filtrar ventas del año 2023
df_2023 = df[df["Fecha"].dt.year == 2023].copy()
df_2023.head()

,ID_Venta,Fecha,Producto,Cantidad,Precio_Unitario,Total_Venta,Vendedor,ID_Cruce
0,1,2023-06-02,Monitor,3,669,2007.0,Elena,101
1,2,2023-12-16,Celular,3,172,516.0,Ana,102
2,3,2023-03-02,Monitor,5,765,3825.0,Elena,103
3,4,2023-03-19,Laptop,4,303,1212.0,Carlos,104
4,5,2023-01-24,Impresora,8,644,5152.0,David,105

In [14]:
#Agregar columna Mes
df_2023["Mes"] = df_2023["Fecha"].dt.month
df_2023[["ID_Venta", "Fecha", "Mes"]].head()

   ID_Venta      Fecha  Mes
0         1 2023-06-02    6
1         2 2023-12-16   12
2         3 2023-03-02    3
3         4 2023-03-19    3
4         5 2023-01-24    1

In [15]:
#Calcular el total de ventas por vendedor
ventas_por_vendedor = (
    df_2023.groupby("Vendedor")["Total_Venta"]
    .sum()
    .reset_index()
    .rename(columns={"Total_Venta": "Total_Ventas"})
    .sort_values("Total_Ventas", ascending=False)
)
print(ventas_por_vendedor.to_string(index=False))

Vendedor  Total_Ventas
     Ana      141425.0
  Carlos      130801.0
 Beatriz      111286.0
   David      104820.0
   Elena       85343.0

In [16]:
#Calcular el total de ventas por mes
ventas_por_mes = (
    df_2023.groupby("Mes")["Total_Venta"]
    .sum()
    .reset_index()
    .rename(columns={"Total_Venta": "Total_Ventas"})
)
print(ventas_por_mes.to_string(index=False))

 Mes  Total_Ventas
   1       38617.0
   2       79020.0
   3       26514.0
   4       19552.0
   5       33014.0
   6       81217.0
   7       26158.0
   8       73812.0
   9       52082.0
  10       47184.0
  11       46118.0
  12       50387.0

In [19]:
#Total de ventas por vendedor y mes

ventas_vendedor_mes = (
    df_2023.groupby(["Vendedor", "Mes"])["Total_Venta"]
    .sum()
    .unstack(fill_value=0)
)

ventas_vendedor_mes.columns.name = "Mes"
ventas_vendedor_mes["TOTAL"] = ventas_vendedor_mes.sum(axis=1)

ventas_vendedor_mes

Mes,1,2,3,4,5,6,7,8,9,10,11,12,TOTAL
Vendedor,,,,,,,,,,,,,
Ana,3927.0,23373.0,7452.0,3366.0,11752.0,4910.0,11754.0,17112.0,11782.0,22795.0,22686.0,516.0,141425.0
Beatriz,11168.0,29034.0,8665.0,2220.0,0.0,10328.0,322.0,20592.0,12640.0,0.0,0.0,16317.0,111286.0
Carlos,11670.0,18440.0,1212.0,0.0,6834.0,14996.0,4860.0,13443.0,13180.0,6082.0,9882.0,30202.0,130801.0
David,11852.0,7295.0,0.0,1530.0,8004.0,31690.0,9222.0,16073.0,0.0,16987.0,0.0,2167.0,104820.0
Elena,0.0,878.0,9185.0,12436.0,6424.0,19293.0,0.0,6592.0,14480.0,1320.0,13550.0,1185.0,85343.0